<?php
//这里不做查询演示了
//$keyword = $_POST['author'];

$arr = [
    [
        'id'   => 1,
        'name' => '李白'
    ],
    [
        'id'   => 2,
        'name' => '李元霸'
    ],
    [
        'id'   => 3,
        'name' => '李世民'
    ],
    [
        'id'   => 4,
        'name' => '李靖'
    ],
    [
        'id'   => 5,
        'name' => '李勣'
    ],
    [
        'id'   => 6,
        'name' => '李广'
    ],
    [
        'id'   => 7,
        'name' => '李时珍'
    ],
    [
        'id'   => 8,
        'name' => '李牧'
    ],
    [
        'id'   => 9,
        'name' => '李斯'
    ],
    [
        'id'   => 10,
        'name' => '李鸿章'
    ],
    [
        'id'   => 11,
        'name' => '李耳'
    ],
    [
        'id'   => 12,
        'name' => '李冰'
    ],
    [
        'id'   => 13,
        'name' => '李信'
    ],
    [
        'id'   => 14,
        'name' => '李典'
    ],
    [
        'id'   => 15,
        'name' => '李孝恭'
    ],
    [
        'id'   => 16,
        'name' => '李商隐'
    ],
    [
        'id'   => 17,
        'name' => '李克用'
    ],
    [
        'id'   => 18,
        'name' => '李煜'
    ],
    [
        'id'   => 19,
        'name' => '李纲'
    ],
    [
        'id'   => 20,
        'name' => '李清照'
    ],
];

echo json_encode($arr);